femaleHeights <- c(
					62, 64, 66, 67, 65, 68, 61, 65, 67, 65, 64,
					63, 67, 68, 64, 66, 68, 69, 65, 67, 62, 66,
					68, 67, 66, 65, 69, 65, 70, 65, 67, 68, 65,
					63, 64, 67, 67)
					
femaleHeightsMean = mean(femaleHeights)
femaleHeightsSD = sd(femaleHeights)
x <- seq(femaleHeightsMean - 4 * femaleHeightsSD,
	femaleHeightsMean + 6 * femaleHeightsSD, length = 1000)

maleHeights <- c(
					69, 67, 69, 70, 65, 68, 69, 70, 71, 69, 66,
					67, 69, 75, 68, 67, 68, 69, 70, 71, 72, 68,
					69, 69, 70, 71, 68, 72, 69, 69, 68, 69, 73,
					70, 73, 68, 69, 71, 67, 68, 65, 68, 68, 69,
					70, 74, 71, 69, 70, 69)
					
maleHeightsMean = mean(maleHeights)
maleHeightsSD = sd(maleHeights)

par(mfrow = c(1, 3))
qqnorm(femaleHeights, datax = "TRUE")
qqline(femaleHeights, datax = "TRUE")
qqnorm(maleHeights, datax = "TRUE")
qqline(maleHeights, datax = "TRUE")
matplot(x, cbind(dnorm(x, femaleHeightsMean, femaleHeightsSD),
	dnorm(x, maleHeightsMean, maleHeightsSD)), type = "l", col = c("red", "blue"))
# За примерокот од женските испитаници, кривата на која лежат точките за набљудувањата
# има благ конвексен облик и повеќето вредности лежат над неа, па има негативно
# искривување (кон десно). За примерокот од машките испитаници, пак, кривата
# на која лежат точките за набљудувањата има благ конкавен облик и повеќето вредности
# лежат под неа, па има позитивно искривување (кон лево).
# 
# Што се однесува до одредувањето на дисперзиите според овие веројатносни графици,
# може да се забележи дека правата која минува низ првиот и третиот квантил за
# популацијата од женските има речиси ист наклон како оној од машките, што сугерира дека
# дисперзиите на двата примерока се речиси исти.
#
# За средната вредност, може да се забележи дека е поголема за машките набљудувајќи ги
# вредностите на x-оската.
#
# Третиот график, иако е само скица на распределбите на примероците кај која е земено
# дека тие имаат токму нормална нормирана распределба, ги има емпириските средни
# вредности и дисперзии. Затоа може да послужи како средство за проверка на заклучоците
# кои сме ги извлекле од набљудувањето на веројатносните графици. Се потврдува тоа дека
# средната вредност на набљудувањата од примерокот од машките е поголема – распределбата
# е поместена кон десно. Друг заклучок е тоа дека дисперзијата е малку поголема за
# женските.
