grades <- c(
				94, 90, 92, 91, 91, 86, 89, 91, 91, 90, 90, 93,
				87, 90, 91, 92, 89, 86, 89, 90, 88, 95, 91, 88,
				89, 92, 87, 89, 95, 92, 85, 91, 85, 89, 88, 84,
				85, 90, 90, 83)

qqnorm(grades, datax = "TRUE")
qqline(grades, datax = "TRUE")
# Може да се каже дека точките лежат на крива која на почетокот е
# конкавна, а потоа конвексна. Набљудувањата кои лежат над правата
# отстапуваат повеќе, т.е. конкавниот дел е поизразен (набљудувањата
# од тој дел отстапуваат повеќе од правата), што значи дека распределбата
# има благо негативно искривување (кон десно).
