measurements <- c(63.2, 67.1, 65.8, 64.0, 65.1, 65.3)

# a
mean(measurements)
abs(65 - mean(measurements))
mean(measurements)/65 - 1
# Разликата е 0.08(3) или 0.001282051 = ~1 промил, па од тоа гледиште би можело
# да се каже дека е доволно мала. Меѓутоа, може да има и вредности со екстремни
# разлики од таа средна вредност, кои сепак кога би се сумирале би дале вредност
# блиска до таа замислена средна вредност (пр. xZamislenaSrednaVrednost = 50,
# primerok = {0, 0, 100, 100} => повторно mean(primerok) == 50 = xZamislenaSrednaVrednost,
# но ниту една поединечна вредност од тој примерок нема вредност блиска до специфицираната.
# Затоа, оваа статистика во случајов не е соодветна за одредување на тоа колку се
# блиски вредностите на примерокот до одредена вредност, ако дополнително не се земе во
# предвид и варијансата/стандардната девијација.

# b
var(measurements)
sd(measurements)

# c
# Главна причина за варијабилност на резултатите би можело да се различните иницијални
# поставувања на апаратурата (бидејќи е наведено дека пред секое мерење одново требало
# да се подготви апаратурата) и можноста за додавање различни количества реагент (исто
# така е наведено дека се користела таква супстанца).
