times <- c(
			0.19, 0.78, 0.96, 1.31, 2.78, 3.16, 4.15,
			4.67, 4.85, 6.5, 7.35, 8.01, 8.27, 12.06,
			31.75, 32.52, 33.91, 36.71, 72.89)

qqnorm(times, datax = "TRUE")
qqline(times, datax = "TRUE")
# За распределбата не може да се каже дека е нормална, бидејќи
# отстапувањата на точките од правата се преголеми – ако се замисли
# крива која поминува на најмало растојание од точките, таа би имала
# преголем наклон и остри промени на правецот – би имала облик близок
# до скалестиот, со тоа што овде има мало заоблување наместо остри
# скалила. Остри скалила би имало ако се работи за дискретни податоци,
# а во случајов се континуирани, но има два опсези кои се разделени
# еден од друг (нешто како две точки на натрупување на вредностите
# или два кластери) и еден outlier (72.89). За распределбата може да
# се каже дека има значајно искривување кон лево.
