cyclesToFailure <- c(675, 3650, 175, 1150, 290, 2000, 100, 375)

# a
qqnorm(cyclesToFailure, datax = "TRUE")
qqline(cyclesToFailure, datax = "TRUE")
# Од графикот се забележува дека станува збор за распределба која има
# позитивно искривување, т.е. кон лево, бидејќи на почетокот замислената
# крива која би минувала најблиску до точките за набљудувањата од
# примерокот би растела стрмно, а потоа поблаго и би имала конкавен облик
# со повеќето вредности над таа права и сконцентрирани кон помалите
# вредности (кон лево).

# b
cyclesToFailureTransformed <- log(cyclesToFailure)
qqnorm(cyclesToFailureTransformed, datax = "TRUE")
qqline(cyclesToFailureTransformed, datax = "TRUE")
# Во овој случај беше извршена трансформација на примерокот така што
# новите вредности се вредностите за природниот логаритам од старите
# вредности, односно, за секое набљудување y кое припаѓа на примерокот
# cyclesToFailure, новото соодветно набљудување y^* добиено од y
# (кое ќе припаѓа на новодобиениот примерок cyclesToFailureTransformed)
# важи y^*=ln⁡y. Според веројатносниот график, за новиот примерок може
# да се каже дека има нормална  распределба со големо ниво на сигурност.
