cyclesToFailure <- c(
						1115, 1310, 1540, 1502, 1258, 1315, 1085, 798,
						1020, 865, 2130, 1421, 1109, 1481, 1567, 1883,
						1203, 1270, 1015, 845, 1674, 1016, 1102, 1605,
						706, 2215, 785, 885, 1223, 375, 2265, 1910,
						1018, 1452, 1890, 2100, 1594, 2023, 1315, 1269,
						1260, 1888, 1782, 1522, 1792, 1000, 1820, 1940,
						1120, 910, 1730, 1102, 1578, 758, 1416, 1560,
						1055, 1764, 1330, 1608, 1535, 1781, 1750, 1501,
						1238, 990, 1468, 1512, 1750, 1642)

qqnorm(cyclesToFailure, datax = "TRUE")
qqline(cyclesToFailure, datax = "TRUE")
# Точките лежат блиску до крива која на почетокот е благо конкавна (под правата),
# а потоа е благо конвексна (над правата). Делот каде што е конвексна е поголем и
# повеќето набљудувања лежат над правата, што значи дека распределбата има благо
# негативно искривување (кон десно). Иако за неколку од набљудувањата кон краевите
# би можело интуитивно да се каже дека се outlier-и, тие всушност не се бидејќи се
# вклопуваат во трендот кој се појавува заради природата на податоците од примерокот
# (нивната распределба која не е нормална).
