resistances <- c(45, 38, 47, 41, 35, 43)

# a
var(resistances)
sd(resistances)

# b
resistances1 <- resistances - 35
var(resistances1)
sd(resistances1)
# Повторно се исти варијансата и стандардната девијација. Тие се инваријантни
# во однос на средната вредност на примерокот (која со одземањето на 35 од секој
# од елементите сме ја намалиле за 35).

# c
# Да, може да се искористи стандардната девијација, на следниот начин..
# Нека X = resistances и Y = resistances2 = X * 10.
# Тогаш Var(Y) = D(Y) = D(X*10) = 10^2*D(X) = 100*D(X).
# Ова значи дека без пресметување одново, може да кажеме дека новата варијанса
# ќе биде 100 пати поголема од претходно. Следи проверка.
var(resistances)
resistances2 <- resistances * 10
var(resistances2)
