trial <- matrix(nrow = 5, ncol = 20)

trial[1,] <- c(
				850, 900, 930, 950, 980, 1000, 930, 760, 1000, 960,
				740, 1070, 850, 980, 880, 980, 650, 810, 1000, 960)
trial[2,] <- c(
				960, 960, 880, 850, 900, 830, 810, 880, 800, 760,
				940, 940, 800, 880, 840, 790, 880, 830, 790, 800)
trial[3,] <- c(
				880, 880, 720, 620, 970, 880, 850, 840, 850, 840,
				880, 860, 720, 860, 950, 910, 870, 840, 840, 840)
trial[4,] <- c(
				890, 810, 800, 760, 750, 910, 890, 880, 840, 850,
				810, 820, 770, 740, 760, 920, 860, 720, 850, 780)
trial[5,] <- c(
				890, 780, 760, 790, 820, 870, 810, 810, 950, 810,
				840, 810, 810, 810, 850, 870, 740, 940, 800, 870)

boxplot(trial[1,], trial[2,], trial[3,], trial[4,], trial[5,])
# Петте проби немаат исто ниво на варијабилност – првата има најголема,
# третата има најмала. Ниту еден пар проби немаат исто ниво на варијабилност
# или ист опсег. Истото важи и за медијаната, но сепак медијаните се поблиски
# кај различните проби, со исклучок на првата која отстапува. Секоја од
# групите (пробите) отстапува од вистинската вредност, но во различна мера.
# Притоа, интересно е да се напомене дека сите вредности се поголеми од
# вистинската вредност. Следуваат отстапувањата на мерите на центрираност
# (средната вредност и медијаната) од вистинската вредност, за секој од
# примероците (за секоја од пробите).

for (i in 1 : 5) {
	print(paste("mean(trial[", i, ",]) = ", mean(trial[i,])))
	print(paste("median(trial[", i, ",]) = ", median(trial[i,])))
	print(paste("mean(trial[", i, ",]) - trueMean = ", mean(trial[i,]),
		" - 734.5 = ", mean(trial[i,]) - 734.5))
	print(paste("median(trial[", i, ",]) - trueMean = ", median(trial[i,]),
		" - 734.5 = ", median(trial[i,]) - 734.5))
}
# Се гледа дека најголемо отстапување имаат средната вредност и медијаната
# за првиот примерок, потоа за вториот и третиот, а најмали отстапувања имаат
# средната вредност и медијаната од четвртиот и петтиот примерок. Ова значи
# дека со текот на времето, со последователното вршење на истиот експеримент,
# вредностите се стабилизирале, односно конвергирале кон вистинската вредност.
# Ова можеби е некаков физички феномен кој се појавува кај инструментите за
# мерење после одреден период на мирување (па затоа со користење на истата
# апаратура последователно, се подобрувала точноста).
