viscosities <- c(13.3, 14.5, 15.3, 15.3, 14.3, 14.8, 15.2, 14.5, 14.6, 14.1,
				 14.3, 16.1, 13.1, 15.5, 12.6, 14.6, 14.3, 15.4, 15.2, 16.8,
				 14.9, 13.7, 15.2, 14.5, 15.3, 15.6, 15.8, 13.3, 14.1, 15.4,
				 15.2, 15.2, 15.9, 16.5, 14.8, 15.1, 17.0, 14.9, 14.8, 14.0,
				 15.8, 13.7, 15.1, 13.4, 14.1, 14.8, 14.3, 14.3, 16.4, 16.9,
				 14.2, 16.9, 14.9, 15.2, 14.4, 15.2, 14.6, 16.4, 14.2, 15.7,
				 16.0, 14.9, 13.6, 15.3, 14.3, 15.6, 16.1, 13.9, 15.2, 14.4,
				 14.0, 14.4, 13.7, 13.8, 15.6, 14.5, 12.8, 16.1, 16.6, 15.6)

par(mfrow = c(1, 2))
qqnorm(viscosities[c(1:40)], datax = "TRUE")
qqline(viscosities[c(1:40)], datax = "TRUE")
qqnorm(viscosities[c(41:80)], datax = "TRUE")
qqline(viscosities[c(41:80)], datax = "TRUE")

# Дисперзијата на примерокот составен од првите 40 елементи од иницијалниот примерок
# има помала дисперзија од оној од последните 40, што се гледа од наклонот на правата.
# Примерокот од првите 40 елементи има heavy-tailed distribution, бидејќи на почетокот
# точките за набљудувањата лежат над правата, а потоа под. Заради благиот конвексен
# облик и притоа поставеноста на повеќето точки под правата, може да се каже дека се
# работи за негативно искривување (кон десно).
#
# Примерокот од последните 40 набљудувања од иницијалниот примерок има распределба за
# која би можело да се каже дека е нормална, ако се занемари малиот конкавен дел кон
# средината, каде што точките лежат над правата и има релативно големо отстапување.
# Сепак тој дел предизвикува оваа распределба да отстапува од нормалната, т.е. да има
# позитивно искривување (кон лево).
