diameters <- c(74.001, 74.003, 74.015, 74, 74.005, 74.002, 74.005, 74.004)

qqnorm(diameters, datax = "TRUE")
qqline(diameters, datax = "TRUE")
# Во случајов, на прв поглед би можело да се каже дека точките се блиску
# до правата, т.е. дека се работи за нормална распределба. Меѓутоа, постои
# еден екстремен outlier – за набљудувањето 74.015. Ако не би постоел тој
# outlier во примерокот, тогаш би заклучиле дека примерокот има нормална
# распределба со дисперзија помала од 1 (дисперзијата на распределбата
# N(0, 1) со која се споредува онаа на примерокот, бидејќи аголот за
# наклонот на правата е поголем од π/4 (нејзиниот коефициент на правец е
# поголем од 1).
